---
title: IFCImportOptions
classe: Autodesk.Revit.DB.IFC.IFCImportOptions
namespace: Autodesk.Revit.DB.IFC
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 12
---

# IFCImportOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `IFCImportAction Action { get; set; }` | `iFCImportOptions.Action` | IFCImportAction |
| `Boolean AutocorrectOffAxisLines { get; set; }` | `iFCImportOptions.AutocorrectOffAxisLines` | Boolean |
| `Boolean AutoJoin { get; set; }` | `iFCImportOptions.AutoJoin` | Boolean |
| `Boolean CreateLinkInstanceOnly { get; set; }` | `iFCImportOptions.CreateLinkInstanceOnly` | Boolean |
| `Boolean ForceImport { get; set; }` | `iFCImportOptions.ForceImport` | Boolean |
| `IFCImportIntent Intent { get; set; }` | `iFCImportOptions.Intent` | IFCImportIntent |
| `Boolean IsValidObject { get; }` | `iFCImportOptions.IsValidObject` | Boolean |
| `String RevitLinkFileName { get; set; }` | `iFCImportOptions.RevitLinkFileName` | String |
| `Void Dispose()` | `iFCImportOptions.Dispose()` | Void |
| `LinkConversionData GetConversionData()` | `iFCImportOptions.GetConversionData()` | LinkConversionData |
| `IDictionary<String, String> GetExtraOptions()` | `iFCImportOptions.GetExtraOptions()` | IDictionary<String, String> |
| `Void SetExtraOptions(IDictionary<String, String>)` | `iFCImportOptions.SetExtraOptions(options)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```